{
  "mkt": [
    {
      "name": "What Everyone Needs to Know About Content Marketing",
      "url": "https://www.youtube.com/embed/TkskQD1Lt4A",
      "description": "In this video we're walking you through effective inbound content marketing, and how it can grow your brand. Marketing has changed and looks way different today than it did before the internet and social media took over. Inbound content marketing is all around us via the blogs, podcasts, videos, etc. that we consume on a daily basis. Watch to learn more about how you can grow your brand using channels like these to reach your audience!"
    },
    {
      "name": "Become a Lead Generation Machine",
      "url": "https://www.youtube.com/embed/Zl2NEKUCZSg",
      "description": "Joana Galvao breaks down how she productized her entire business to be able to take a 4 month maternity leave while her team ran the business without her; all while being more profitable, and how you can do the same as a freelance designer."
    },
    {
      "name": "Email Marketing for Beginners",
      "url": "https://www.youtube.com/embed/94gHaHKmD4Q",
      "description": "Email marketing is the most efficient and effective way for businesses to communicate with their customers. In this video, we're walking you through the process of mastering email marketing. Our goal is to help you provide value to your readers with every click. Less spamming, more planning, for results that are outstanding!"
    },
    {
      "name": "Fundamentals of Copywriting",
      "url": "https://www.youtube.com/embed/mWNYE5yVOzk",
      "description": "This video contains everything you need to get started with copywriting  (including how to find clients...)"
    },
    {
      "name": "Understanding Sales Funnels",
      "url": "https://www.youtube.com/embed/CM-RAMN_mgY",
      "description": "So, you want to make money online, but where do you start? What is a sales funnel? How do you market it to the right audience? Look no further because ClickFunnels creator, Russell Brunson, will teach you! Become an expert and change your life."
    }
  ],
  "sls": [
    {
      "name": "MEDDPICC explained in a 10 Minute Video",
      "url": "https://www.youtube.com/embed/l4yTE-5R5Zo",
      "description": "MEDDIC as it was first known is the number one methodology in enterprise sales. This video gives a brief overview of each element of the most commonly implemented connotation of MEDDPICC and MEDDICC."
    },
    {
      "name": "Sales Methodologies | Solution selling",
      "url": "https://www.youtube.com/embed/ALGyCWmkrC8",
      "description": "To discover a clear solution selling methodology, just watch the video, but to start building a solution selling process for your sales team (and to make sure you have the right solution selling training in place) we recommend reading the article linked above."
    },
    {
      "name": "“Challenger Sale” Mastery!",
      "url": "https://www.youtube.com/embed/e-pEmiTRhIQ",
      "description": "On this episode of The Salesman Podcast David shares a step by step guide to what the Challenger Sale is and how we can implement it's success principles into our B2B sales game."
    },
    {
      "name": "SALES Is Just Like DATING",
      "url": "https://www.youtube.com/embed/ywwg-H1otaY",
      "description": "If we try to 'close the deal' by bragging about our accomplishments and material possessions, we won't get very far. But if we start by sharing what we believe and WHY we are who we are (or do what we do) we give people the opportunity to connect with us on a deeper, more human level. People don't buy what you do, they buy WHY you do it."
    },
    {
      "name": "How To Pitch Anything",
      "url": "https://www.youtube.com/embed/H5XgrQ0pY5A",
      "description": "Oran Klaff explains very simply how sales professionals can pitch any product effectively. 1) Why you need to use the phrase 'it used to be' often. 2) How to differentiate from your competition. 3) The importance of picking one thing and becoming GREAT at it. 4) If you'd like to know how to close a business pitch then this episode with Oren if for you. "
    }
  ],
  "tmg": [
    {
      "name": "Manage Your Time More Effectively",
      "url": "https://www.youtube.com/embed/tlddeUri3GM",
      "description": "Let me introduce you to the Parkinson's Law. The law states this: 'Work expands so as to fill the time available for its completion.' Essentially the more time you have to complete something, the longer it will take you to finish it. And the less time you have to complete your goal, the more likely it is that you'll complete it in proposed time. But if a goal or a task does not have a specific deadline set, it will most likely never get done. In this video you'll learn how to use the Parkinson's Law to your advantage and manage your time more effectively thanks to it."
    },
    {
      "name": "10 Time Management Tips",
      "url": "https://www.youtube.com/embed/iONDebHX9qk",
      "description": "Most people struggle to manage time efficiently in their personal and professional lives. Ali Abdaal will reveal 10 Time Management Tips that he uses to manage time as effectively as he can in his daily life."
    },
    {
      "name": "Timeboxing: Elon Musk's Time Management Method",
      "url": "https://www.youtube.com/embed/fbAYK4KQrso",
      "description": "Elon Musk's daily schedule is incredibly demanding, but he ensures that everything gets done by scheduling everything in 5-minute time blocks. This technique is called 'time boxing', and in today's video I'll show you how to make the most of it."
    },
    {
      "name": "Time Management Tips by Jim Kwik",
      "url": "https://www.youtube.com/embed/vL2aMjFS3sI",
      "description": ""
    },
    {
      "name": "7 Things Organized People Do (That You Prob Don't Do",
      "url": "https://www.youtube.com/embed/tlFGOSEI_lo",
      "description": "Today's video focuses on the 5th element in the Limitless model and how to maximize the one resource we all have to reach our productivity goals: time."
    },
    {
      "name": "How to Master Time Management - Part 1",
      "url": "https://www.youtube.com/embed/fWRF6BJ1OQk",
      "description": "When it comes to non-medication ways to manage your ADHD symptoms, we can break it down into three domains: time management, organization and planning."
    },
    {
      "name": "How to Master Time Management - Part 2",
      "url": "https://www.youtube.com/embed/yj6_1t1PAcE",
      "description": "With ADHD, procrastination is huge.This video will teach you how to follow through with tasks that you would ordinarily put off."
    }
  ]
}